In [1]:
import pandas as pd

In [15]:
excel=pd.ExcelFile('../datasets/dos_hojas.xlsx')

In [16]:
excel

In [17]:
hoja_1=pd.read_excel(excel, 'Hoja1')
hoja_1

    Unnamed: 0  Unnamed: 0.1  Nombre  Edad  col
0            0             0    Juan    10    0
1            1             1    Pepe    20    1
2            2             2  Javier    25    4
3            3             3    Juan  15xº    9
4            4             4    Pepe    10   16
5            5             5  Javier    20   25
6            6             6    Juan    25   36
7            7             7    Pepe  15xº   49
8            8             8  Javier    10   64
9            9             9    Juan    20   81
10          10            10    Pepe    25  100
11          11            11  Javier  15xº  121
12          12            12    Juan    10  144
13          13            13    Pepe    20  169
14          14            14  Javier    25  196

In [18]:
hoja_2=pd.read_excel(excel, 'Hoja2')
hoja_2

    Unnamed: 0  Unnamed: 0.1 Nombre  Edad  col
0            0             0  Maria    10    0
1            1             1    Ana    20    1
2            2             2  Laura    25    4
3            3             3  Maria  15xº    9
4            4             4    Ana    10   16
5            5             5  Laura    20   25
6            6             6  Maria    25   36
7            7             7    Ana  15xº   49
8            8             8  Laura    10   64
9            9             9  Maria    20   81
10          10            10    Ana    25  100
11          11            11  Laura  15xº  121
12          12            12  Maria    10  144
13          13            13    Ana    20  169
14          14            14  Laura    25  196

In [19]:
df=pd.read_excel('../datasets/dos_hojas.xlsx', 'Hoja2')

In [21]:
df['col2']=[i**2 for i in range(len(df))]

df.head()

   Unnamed: 0  Unnamed: 0.1 Nombre  Edad  col  col2
0           0             0  Maria    10    0     0
1           1             1    Ana    20    1     1
2           2             2  Laura    25    4     4
3           3             3  Maria  15xº    9     9
4           4             4    Ana    10   16    16

In [22]:
df.to_excel(excel, 'Hoja2')

In [26]:
import pandas as pd

def write_excel(filename,sheetname,dataframe):
    with pd.ExcelWriter(filename, engine='openpyxl', mode='a') as writer: 
        workBook = writer.book
        try:
            workBook.remove(workBook[sheetname])
        except:
            print("Worksheet does not exist")
        finally:
            dataframe.to_excel(writer, sheet_name=sheetname,index=False)
            writer.save()

            
df = pd.DataFrame({'Col1':[1,2,3,4,5,6], 'col2':['foo','bar','foobar','barfoo','foofoo','barbar']})

write_excel('../datasets/dos_hojas.xlsx','Hoja3',df)

Worksheet does not exist

In [27]:
pd.read_excel('../datasets/dos_hojas.xlsx', 'Hoja3')

   Col1    col2
0     1     foo
1     2     bar
2     3  foobar
3     4  barfoo
4     5  foofoo
5     6  barbar

In [28]:
dictio={'nombre':['Juan', 'Maria', 'Pepe'],
       'edad':[12, 10, 14],
       'altura':[130, 110, 100]}

In [30]:
pd.DataFrame(dictio)

  nombre  edad  altura
0   Juan    12     130
1  Maria    10     110
2   Pepe    14     100

In [31]:
dictio={'nombre':'Juan',
       'edad':12,
       'altura':130}

In [36]:
pd.DataFrame(dictio, index=[0])

  nombre  edad  altura
0   Juan    12     130

In [37]:
dictio={'nombre':['Juan'],
       'edad':[12],
       'altura':[130]}

pd.DataFrame(dictio)

  nombre  edad  altura
0   Juan    12     130

In [39]:
df.to_dict()

{'Col1': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6},
 'col2': {0: 'foo',
  1: 'bar',
  2: 'foobar',
  3: 'barfoo',
  4: 'foofoo',
  5: 'barbar'}}

In [42]:
pd.read_json('../datasets/alumnos.json', orient='records').head()

  Nombre  Edad
0   Pepe    10
1   Juan    20
2   Luis    25
3   Fran  15xº

In [44]:
df.to_json()

'{"Col1":{"0":1,"1":2,"2":3,"3":4,"4":5,"5":6},"col2":{"0":"foo","1":"bar","2":"foobar","3":"barfoo","4":"foofoo","5":"barbar"}}'

In [46]:
df.Col1.to_list()

[1, 2, 3, 4, 5, 6]

In [50]:
df[ (df.Col1>2) & (df.col2=='barfoo') ]

   Col1    col2
3     4  barfoo

In [53]:
df['col3']=[i**2 for i in range(len(df))]
df

   Col1    col2  col3
0     1     foo     0
1     2     bar     1
2     3  foobar     4
3     4  barfoo     9
4     5  foofoo    16
5     6  barbar    25

In [54]:
df[ (df.Col1>5) | (df.col2=='barfoo') ]

   Col1    col2  col3
3     4  barfoo     9
5     6  barbar    25

In [56]:
df.iloc[0:2, 0:2]

   Col1 col2
0     1  foo
1     2  bar

In [67]:
df.loc[0]

Col1      1
col2    foo
col3      0
Name: 0, dtype: object

In [ ]:
# metodos habituales de pandas

df.head()         # printea la cabeza, por defecto 5 filas
df.tail()         # pritea la cola, por defecto 5 filas
df.describe()     # descripcion estadistica
df.info()         # informacion del df
df.info(memory_usage='deep')
df.columns        # muestra columna
df.index          # muestra indice
df.dtypes         # muestra tipos de datos de las columnas
df.plot()         # hace un grafico
df.hist()         # hace un histograma
df.col.value_counts() # cuenta los valores unicos de una columna
df.col.unique()       # muestra valores unicos de una columna
df.copy()             # copia el df
df.drop()             # elimina columnas o filas (axis=0,1)
df.dropna()           # elimina nulos
df.fillna()           # rellena nulos
df.shape              # dimensiones del df
df._get_numeric_data()  # selecciona columnas numericas
df.rename()             # renombre columnas
df.str.replace()        # reemplaza columnas de strings
df.astype(dtype='float32')  # cambia el tipo de dato
df.iloc[]                   # localiza por indice
df.loc[]                    # localiza por elemento
df.transpose()              # transpone el df
df.T
df.sample(n, frac)          # muestra del df
df.col.sum()                  # suma de una columna
df.col.max()
df.col.min()
df[col]         # selecciona columna
df.col
df.isnull()    # valores nulos
df.isna()
df.drop_duplicates() # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe

In [74]:
dictio.get('nombres', 'hola')

'hola'

In [81]:
df.get('Col10', [i for i in range(len(df))])

[0, 1, 2, 3, 4, 5]

In [ ]:
websites_clean['SERVER'] = websites_clean['SERVER']\
.map(lambda x: 'Microsoft' if 'Microsoft'  in x else ('Apache' if 'Apache'  \
                                                      in x else ('nginx' if 'nginx'  in x else 'other')))

In [82]:
def suma(a,b):
    return a+b

In [83]:
suma(2,3)

5

In [86]:
suma2=lambda x,y: x+y

In [87]:
suma2(2,3)

5

In [ ]:
lambda x: 'Microsoft' if 'Microsoft'  in x else ('Apache' if 'Apache'  \
                                                      in x else ('nginx' if 'nginx'  in x else 'other'))

In [ ]:
def map_(x):
    if 'Microsoft' in x:
        return 'Microsoft'
    
    elif 'Apache' in x:
        return 'Apache' 
    
    elif 'nginx' in x:
        return 'nginx'  
    else:
        return 'other'

In [ ]:
websites_clean['SERVER'] = websites_clean['SERVER'].apply(lambda x: map_(x))